In [1]:
import pandas as pd

In [2]:
titanic_train = pd.read_csv("https://raw.githubusercontent.com/jaygil8755/ML01/master/train.csv")

In [3]:
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
titanic_train.drop(['PassengerId', 'Name', 'Ticket', 'Cabin'], axis = 1, inplace = True)

In [5]:
titanic_train.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [6]:
titanic_train['Age'].fillna(titanic_train['Age'].median(),inplace=True)
titanic_train['Embarked'].fillna("S",inplace=True)

In [7]:
titanic_train.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [8]:
titanic_train.head(3)

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S

In [9]:
pd.get_dummies(titanic_train)

,Survived,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,0,3,22.0,1,0,7.2500,0,1,0,0,1
1,1,1,38.0,1,0,71.2833,1,0,1,0,0
2,1,3,26.0,0,0,7.9250,1,0,0,0,1
3,1,1,35.0,1,0,53.1000,1,0,0,0,1
4,0,3,35.0,0,0,8.0500,0,1,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,27.0,0,0,13.0000,0,1,0,0,1
887,1,1,19.0,0,0,30.0000,1,0,0,0,1
888,0,3,28.0,1,2,23.4500,1,0,0,0,1
889,1,1,26.0,0,0,30.0000,0,1,1,0,0
890,0,3,32.0,0,0,7.7500,0,1,0,1,0

In [10]:
titanic_train['Pclass'].describe()

count    891.000000
mean       2.308642
std        0.836071
min        1.000000
25%        2.000000
50%        3.000000
75%        3.000000
max        3.000000
Name: Pclass, dtype: float64

In [11]:
titanic_train['Pclass']=titanic_train['Pclass'].astype(str)
pd.get_dummies(titanic_train).head()

,Survived,Age,SibSp,Parch,Fare,Pclass_1,Pclass_2,Pclass_3,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,0,22.0,1,0,7.2500,0,0,1,0,1,0,0,1
1,1,38.0,1,0,71.2833,1,0,0,1,0,1,0,0
2,1,26.0,0,0,7.9250,0,0,1,1,0,0,0,1
3,1,35.0,1,0,53.1000,1,0,0,1,0,0,0,1
4,0,35.0,0,0,8.0500,0,0,1,0,1,0,0,1

In [12]:
titanic_train = pd.get_dummies(titanic_train)

In [13]:
titanic_feature = titanic_train.drop('Survived', axis = 1)
titanic_label = titanic_train['Survived']

In [14]:
from sklearn.model_selection import train_test_split

In [15]:
x_train, x_test, y_train, y_test = train_test_split(titanic_feature, titanic_label)

In [16]:
x_train.shape, y_train.shape

((668, 12), (668,))

In [17]:
x_test.shape, y_test.shape

((223, 12), (223,))

In [18]:
x_train.head()

,Age,SibSp,Parch,Fare,Pclass_1,Pclass_2,Pclass_3,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
20,35.0,0,0,26.0000,0,1,0,0,1,0,0,1
571,53.0,2,0,51.4792,1,0,0,1,0,0,0,1
808,39.0,0,0,13.0000,0,1,0,0,1,0,0,1
541,9.0,4,2,31.2750,0,0,1,1,0,0,0,1
634,9.0,3,2,27.9000,0,0,1,1,0,0,0,1

In [19]:
y_train.head()

20     0
571    1
808    0
541    0
634    0
Name: Survived, dtype: int64

In [20]:
from sklearn.tree import DecisionTreeClassifier

In [21]:
model = DecisionTreeClassifier()

In [22]:
model.fit(x_train, y_train)

DecisionTreeClassifier()

In [23]:
prediction = model.predict(x_test)

In [24]:
from sklearn.metrics import accuracy_score

In [25]:
accuracy_score(y_test, prediction)

0.7757847533632287

In [26]:
(y_test == prediction).mean()

0.7757847533632287

## 정리된 내용!!!!1

In [27]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.tree import DecisionTreeClassifier
from sklearn.metrics import accuracy_score

titanic_feature = titanic_train.drop('Survived', axis = 1)
titanic_label = titanic_train['Survived']

x_train, x_test, y_train, y_test = train_test_split(titanic_feature, titanic_label)

model = DecisionTreeClassifier()

model.fit(x_train, y_train)

prediction = model.predict(x_test)


print('정확도는: %.3f' % accuracy_score(y_test, prediction))

정확도는: 0.780